#+OPTIONS: toc:nil

* Sum square difference

** Task

The sum of the squares of the first ten natural numbers is,

1^2 + 2^2 + ... + 10^2 = 385
The square of the sum of the first ten natural numbers is,

(1 + 2 + ... + 10)^2 = 55^2 = 3025
Hence the difference between the sum of the squares of the first ten natural
numbers and the square of the sum is 3025 − 385 = 2640.

Find the difference between the sum of the squares of the first one hundred
natural numbers and the square of the sum.

** Solution

#+BEGIN_SRC python :results output :exports both
import math

limit = 100

sum1 = sum([math.pow(x, 2) for x in range(1, limit + 1)])
sum2 = math.pow(sum([x for x in range(1, limit + 1)]), 2)

print(sum2 - sum1)
#+END_SRC

#+RESULTS:
: 25164150.0
